Repository: yben27/emacslispref
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: fr_fr

source: Lookup in a hash table is extremely fast for large tables---in fact, the time required is essentially @emph{independent} of how many elements are stored in the table. For smaller tables (a few tens of elements) alists may still be faster because hash tables have a more-or-less constant overhead.
fr_fr: Une recherche dans une table de hachage est extrêmement rapide pour les grandes tables. En fait, le temps nécessaire est, avant tout, @emph{indépendant} du nombre d'éléments contenus dans la table. Pour les plus petites tables (quelques dizaines d'éléments), les listes d'association peuvent quand même être plus rapides parce que les tables de hachage ont un temps système plus-ou-moins constant.

source: Macros are a way to extend the Lisp language.
fr_fr: Les macros sont un moyen d'étendre le langage Lisp.

source: Many of the examples in this manual print text when they are evaluated. If you execute example code in a Lisp Interaction buffer (such as the buffer @samp{*scratch*}), the printed text is inserted into the buffer. If you execute the example by other means (such as by evaluating the function @code{eval-region}), the printed text is displayed in the echo area.
fr_fr: Plusieurs des exemples de ce manuel affichent du texte quand ils sont évalués. Si vous exécutez le code d'exemple dans un tampon d'interaction de Lisp (tel que le tampon @samp{*scratch*}), le texte affiché est inséré dans le tampon. Si vous exécutez l'exemple par d'autres moyens (comme pour évaluer la fonction @code{eval-région}), le texte affiché est montré dans le secteur d'écho.

source: Many of the functions described in this chapter accept markers for arguments in place of numbers. (@xref{Markers}.) Since the actual arguments to such functions may be either numbers or markers, we often give these arguments the name @var{number-or-marker}. When the argument value is a marker, its position value is used and its buffer is ignored.
fr_fr: Plusieurs des fonctions décrites dans ce chapitre acceptent des marqueurs comme arguments au lieu des nombres. (@xref{Markers}.) Puisque les arguments réels à de telles fonctions peuvent être des nombres ou des marqueurs, nous donnons souvent à ces arguments le nom de @var{number-or-marker}. Quand la valeur d'argument est un marqueur, sa valeur de position est employée et son tampon est ignoré.

source: Many of the specialized editing and I/O facilities of Emacs accept only strings. For example, you cannot insert a vector of characters into a buffer the way you can insert a string. @xref{Strings and Characters}.
fr_fr: Beaucoup d'équipements d'édition spécialisée et d'entrée-sortie d'Emacs acceptent seulement des chaînes de caractères. Par exemple, vous ne pouvez pas insérer un vecteur de caractères dans une mémoire tampon de la même façon qu'une chaîne de caractères peut l'être. @xref{Strings and Characters}.

source: Markers
fr_fr: Marqueurs

source: Math Functions
fr_fr: Fonctions mathématiques

source: Modifying Strings
fr_fr: Modifier des chaînes

source: More examples:
fr_fr: Autres exemples:

source: Most modern computers support the @acronym{IEEE} floating point standard, which provides for positive infinity and negative infinity as floating point values. It also provides for a class of values called NaN or ``not-a-number''; numerical functions return such values in cases where there is no correct answer. For example, @code{(/ 0.0 0.0)} returns a NaN. For practical purposes, there's no significant difference between different NaN values in Emacs Lisp, and there's no rule for precisely which NaN value should be used in a particular case, so Emacs Lisp doesn't try to distinguish them (but it does report the sign, if you print it). Here are the read syntaxes for these special floating point values:
fr_fr: La plupart des ordinateurs modernes soutiennent la norme à virgule flottante @acronym{IEEE}, qui prévoit plus l'infini et moins l'infini comme valeurs à virgule flottante. Elle prévoit également une classe de valeurs appelées NaN ou « not-a-number »; les fonctions numériques renvoient de telles valeurs dans les cas où il n'y a aucune réponse correcte. Par exemple, @code{(/ 0.0 0.0)} renvoie NaN. Pour des buts pratiques, il n'y a aucune différence significative entre différentes valeurs de NaN en Emacs Lisp, et il n'y a aucune règle pour la valeur NaN à utiliser dans un cas particulier, ainsi Emacs Lisp n'essaye pas de les distinguer (mais rapporte le signal, si vous l'affichez). Voici les syntaxes lues pour ces valeurs à virgule flottante spéciales :

source: Most of the GNU Emacs text editor is written in the programming language called Emacs Lisp. You can write new code in Emacs Lisp and install it as an extension to the editor. However, Emacs Lisp is more than a mere ``extension language''; it is a full computer programming language in its own right. You can use it as you would any other programming language.
fr_fr: La majeure partie de l'éditeur de texte GNU Emacs est écrite dans le langage de programmation appelé Emacs Lisp. Vous pouvez écrire du code en Emacs Lisp et l'installer comme extension de l'éditeur. Cependant, Emacs Lisp est plus qu'un simple « langage d'extension » ; c'est un langage de programmation d'ordinateur complet et autonome. Vous pouvez l'employer comme n'importe quel autre langage de programmation.

source: New Symbols
fr_fr: Nouveaux symboles

source: Non-ASCII Characters
fr_fr: Caractères non-ASCII

source: Normally the function @code{define-abbrev} sets the variable @code{abbrevs-changed} to @code{t}, if it actually changes the abbrev. (This is so that some commands will offer to save the abbrevs.) It does not do this for a ``system'' abbrev, since those won't be saved anyway.
fr_fr: Habituellement, la fonction @code{define-abbrev} définit la variable @code{abbrevs-changed} en @code{t}, si elle change effectivement l'abréviation. (C'est un fait que certaines commandes demandent d'enregistrer les abbrevs.) Il ne l'effectue pas pour un ``system'' abbrev, puisque ceux-ci ne seront pas enregistrer de toute façon.

source: Notation for describing functions, variables, etc.
fr_fr: Notation pour décrire des fonctions, des variables, etc.

source: Numbers
fr_fr: Nombres

source: Numbers and arithmetic functions.
fr_fr: Nombres et fonctions arithmétiques.

source: Numeric Conversions
fr_fr: Conversions numériques

source: Obarrays are also a kind of hash table, but they are a different type of object and are used only for recording interned symbols (@pxref{Creating Symbols}).
fr_fr: Les obarrays sont aussi une sorte de table de hachage mais ils sont un type d'objet différent et sont seulement utilisés pour enregistrer des symboles internes (@pxref{Creating Symbols}).

source: Obtaining random integers, predictable or not.
fr_fr: Obtention des nombres entiers aléatoires, prévisibles ou pas.

source: Omitting the argument @var{end} is equivalent to specifying @code{nil}. It follows that @code{(substring @var{string} 0)} returns a copy of all of @var{string}.
fr_fr: Omettre l’argument @var{end} équivaut à indiquer @code{nil}. Il en va que @code{(substring @var{string} 0)} retourne une copie entière de @var{string}.

source: On some machines, any integer representable in Lisp may be the result of @code{random}. On other machines, the result can never be larger than a certain maximum or less than a certain (negative) minimum.
fr_fr: Sur quelques machines, n'importe quel nombre entier représentable en Lisp peut être le résultat de @code{random}. Sur d'autres machines, le résultat peut ne jamais être plus grand qu'un certain maximum ou moins qu'un certain minimum (négatif).

source: On the other hand, shifting one place to the right looks like this:
fr_fr: D'autre part, le décalage d'une place vers la droite ressemble à ceci :

source: Other Hash Table Functions
fr_fr: Autres fonctions pour les tables de hachage

source: Other functions to compare with this one include @code{char-to-string} (@pxref{String Conversion}), @code{make-vector} (@pxref{Vectors}), and @code{make-list} (@pxref{Building Lists}).
fr_fr: Les autres fonctions à comparer avec celle-ci comprennent @code{char-to-string} (voir la section @xref{Conversion des caractères et des chaînes}), @code{make-vector} (voir la section @xref{Vecteurs}), et @code{make-list} (voir la section @xref{Building Cons Cells and Lists}).

source: Overall, the key-value pairs passed to @var{function} describe all the values stored in @var{char-table}.
fr_fr: En général, les paires clé-valeur passées à la fonction @var{function} décrivent toutes les valeurs stockées dans @var{char-table}.

source: Pairs of characters are compared according to their character codes. Keep in mind that lower case letters have higher numeric values in the @acronym{ASCII} character set than their upper case counterparts; digits and many punctuation characters have a lower numeric value than upper case letters. An @acronym{ASCII} character is less than any non-@acronym{ASCII} character; a unibyte non-@acronym{ASCII} character is always less than any multibyte non-@acronym{ASCII} character (@pxref{Text Representations}).
fr_fr: Les pairs de caractères sont comparées selon leurs codes de caractère. Garder en tête que les lettres minuscules ont des valeurs numériques supérieures en @acronym{ASCII} que leurs homologues majuscules; les chiffres et beaucoup de caractères de ponctuation ont une valeur numérique inférieure à celle des lettres majuscules. Un caractère @acronym{ASCII} est inférieur à tout caractère non @acronym{ASCII}; un caractère uni-octet non @acronym{ASCII} est toujours inférieur à tout caractère multi-octet non @acronym{ASCII} (voir la section @pxref{Text Representations}).

source: Please mail comments and corrections to
fr_fr: Merci d'envoyer vos commentaires et corrections à

source: Predicates for Strings
fr_fr: Prédicats pour les chaînes

source: Predicates on Numbers
fr_fr: Attributs des nombres

source: Print name
fr_fr: Nom d'affichage

source: Printing Notation
fr_fr: Notation d'affichage

source: Processes
fr_fr: Processus

source: Property Lists
fr_fr: Listes de propriétés

source: Property list
fr_fr: Liste de propriétés

source: Random Numbers
fr_fr: Nombres aléatoires

source: Reading files of Lisp code into Lisp.
fr_fr: Lire des fichiers de code Lisp depuis Lisp.

source: Recall that the @dfn{sequence} type is the union of two other Lisp types: lists and arrays. In other words, any list is a sequence, and any array is a sequence. The common property that all sequences have is that each is an ordered collection of elements.
fr_fr: Il faut se rappeler que le type @dfn{sequence} est l'union de deux autres types Lisp : les listes et les tableaux. Autrement dit, toute liste est une suite et tout tableau est une suite. La propriété commune à toutes les suites est que chacune est un ensemble ordonné d'éléments.

source: Refers to the default value.
fr_fr: Renvoie à la valeur par défaut.

source: Refers to the element for character @var{char} (supposing @var{char} is a valid character code).
fr_fr: Renvoie à l'élément pour le caractère @var{char} (en supposant que @var{char} est un code caractère valide).

source: Refers to the value specified for the whole character set @var{charset} (@pxref{Character Sets}).
fr_fr: Renvoie à la valeur spécifiée pour tout l'ensemble de caractères @var{charset} (@pxref{Character Sets}).

source: Refers to the whole range of character codes.
fr_fr: Renvoie à tout l'ensemble des codes de caractère.

source: Refresh Screen
fr_fr: Rafraîchissement de l'écran

source: Replace the specification with a single @samp{%}. This format specification is unusual in that it does not use a value. For example, @code{(format "%% %d" 30)} returns @code{"% 30"}.
fr_fr: Remplace la spécification par un simple @samp{%}. Cette spécification de format est inhabituelle du fait qu'elle n'utilise pas de valeur. Par exemple, @code{(format "%% %d" 30)} retourne @code{"% 30"}.

source: Replace the specification with notation for a floating point number, using either exponential notation or decimal-point notation, whichever is shorter.
fr_fr: Remplace la spécification par la notation pour un nombre à virgule flottante, en utilisant la notation exponentielle ou la notation point décimal, celle qui est la plus courte.

source: Replace the specification with the base-eight representation of an integer.
fr_fr: Remplace la spécification par la représentation en base huit d'un entier

source: Replace the specification with the base-sixteen representation of an integer. @samp{%x} uses lower case and @samp{%X} uses upper case.
fr_fr: Remplace la spécification par la représentation en base seize d'un entier. @samp{%x} utilise les minuscules et @samp{%X} utilise les majuscules.

source: Replace the specification with the base-ten representation of an integer.
fr_fr: Remplace la spécification par la représentation en base dix d'un entier

source: Replace the specification with the character which is the value given.
fr_fr: Remplace la spécification par le caractère qui est la valeur donnée.

source: Replace the specification with the decimal-point notation for a floating point number.
fr_fr: Remplace la spécification par la notation point décimal pour un nombre à virgule flottante.

source: Replace the specification with the exponential notation for a floating point number.
fr_fr: Remplace la spécification par la notation exponentielle pour un nombre à virgule flottante.

source: Replace the specification with the printed representation of the object, made with quoting (that is, using @code{prin1}---@pxref{Output Functions}). Thus, strings are enclosed in @samp{"} characters, and @samp{\} characters appear where necessary before special characters.
fr_fr: Remplace la spécification par la représentation affichée de l'objet, en utilisant les guillemets (c'est-à-dire, en utilisant @code{prin1}---@pxref{Output Functions}). Ainsi, les chaînes sont placées entres les caractères @samp{"}, et les caractères @samp{\} apparaissent si nécessaire devant les caractères spéciaux.

source: Replace the specification with the printed representation of the object, made without quoting (that is, using @code{princ}, not @code{prin1}---@pxref{Output Functions}). Thus, strings are represented by their contents alone, with no @samp{"} characters, and symbols appear without @samp{\} characters.
fr_fr: Remplace la spécification par les représentations affichées de l'objet, sans utiliser les guillemets (c'est-à-dire, en utilisant @code{princ}, non pas @code{prin1}---@pxref{Output Functions}). Ainsi, les chaînes sont représentées par leurs contenus seuls, sans les caractères @samp{"}, et les symboles apparaissent sans les caractères @samp{\}.

source: Representation and range of floating point.
fr_fr: Représentation et champ des nombres à virgule flottante.

source: Representation and range of integers.
fr_fr: Représentation et champ des nombres entiers.

source: Return a new bool-vector of @var{length} elements, each one initialized to @var{initial}.
fr_fr: Retourne un nouveau vecteur-booléen contenant un nombre @var{length} d'éléments, chacun initialisé à la valeur de l'argument @var{initial}.

source: Return a newly created char-table, with subtype @var{subtype}. Each element is initialized to @var{init}, which defaults to @code{nil}. You cannot alter the subtype of a char-table after the char-table is created.
fr_fr: Retourne une char-table nouvellement créée avec le sous-type @var{subtype}. Chaque élément est initialisé à la valeur @var{init}, qui par défaut est @code{nil}. On ne peut pas changer le sous-type d'une char-table une fois qu'elle est créée.

source: Return non-nil iff @var{object} is one of the two canonical boolean values: @code{t} or @code{nil}.
fr_fr: Retourne non-nil si @var{objet} est une des deux valeurs booléennes canoniques : @code{t} ou @code{nil}.

source: Returns @code{t} if @var{object} is a list, vector, string, bool-vector, or char-table, @code{nil} otherwise.
fr_fr: Retourne @code{t} si @var{object} est une liste, un vecteur, une chaîne de caractères, un vecteur-booléen ou une table de chaînes de caractères ; sinon @code{nil}.

source: Returns a copy of @var{sequence}. The copy is the same type of object as the original sequence, and it has the same elements in the same order.
fr_fr: Cette fonction retourne une copie de la suite @var{sequence}. Cette copie a le même type que l'objet de la suite d'origine. Elle a également les mêmes éléments dans le même ordre.

source: Rounding Operations
fr_fr: Opérations d'arrondissage

source: Saving Abbrevs in Files
fr_fr: Enregistrer des abréviations dans les fichiers

source: Saving abbrevs in files.
fr_fr: Enregistre des abréviations dans les fichiers.

source: Searching and Matching
fr_fr: Recherches et correspondances

source: Searching buffers for strings or regexps.
fr_fr: Rechercher une chaîne ou expression rationnelle dans un buffer.

source: See @code{put} for an example.
fr_fr: Consultez @code{put} pour un exemple.

source: See also @code{append} in @ref{Building Lists}, @code{concat} in @ref{Creating Strings}, and @code{vconcat} in @ref{Vector Functions}, for other ways to copy sequences.
fr_fr: Pour d'autres méthodes de copie de listes, voir également @code{append} dans @ref{Building Lists, @code{concat} dans @ref{Creating Strings}, et @code{vconcat} dans @ref{Vector Functions}.

source: See also @code{string-bytes}, in @ref{Text Representations}.
fr_fr: Voir aussi @code{string-bytes}, dans @ref{Text Representations}.

source: See also the @code{compare-buffer-substrings} function in @ref{Comparing Text}, for a way to compare text in buffers. The function @code{string-match}, which matches a regular expression against a string, can be used for a kind of string comparison; see @ref{Regexp Search}.
fr_fr: Voir aussi la fonction @code{compare-buffer-substrings} dans @ref{Comparing Text}, pour la comparaison de texte dans les mémoires tampons. La fonction @code{string-match}, qui compare une expression régulière à une chaîne, peut être utilisée pour un type de comparaison de chaînes; voir @ref{Regular Expression Searching}.

source: See also the function @code{elt}, in @ref{Sequence Functions}.
fr_fr: Voir aussi la fonction @code{elt}, dans la partie @ref{Sequence Functions}.

source: See also the function @code{format} in @ref{Formatting Strings}.
fr_fr: Voir aussi la fonction @code{format} dans @ref{Formatting Strings}.

source: Sequence Functions
fr_fr: Fonctions pour les suites

source: Sequences
fr_fr: Suites

source: Sequences, Arrays, and Vectors
fr_fr: Suites, Tableaux et vecteurs

source: Setting Up Abbrev Mode
fr_fr: Démarrer le mode abbrev

source: Setting up Emacs for abbreviation.
fr_fr: Configuration d'Emacs pour l'abréviation.

source: Several keywords make sense in @code{make-hash-table}, but the only two that you really need to know about are @code{:test} and @code{:weakness}.
fr_fr: Plusieurs mots-clés ont une signification pour la fonction @code{make-hash-table} mais les deux seuls qu'il faut vraiment connaître sont @code{:test} et @code{:weakness}.

source: Shifting a pattern of bits two places to the left produces results like this (with 8-bit binary numbers):
fr_fr: Lorsqu'on décale de deux places une combinaison de chiffres binaires vers la gauche, on produit les résultats suivants (avec des nombres binaires de 8 bits) :

source: Since @code{format} interprets @samp{%} characters as format specifications, you should @emph{never} pass an arbitrary string as the first argument. This is particularly true when the string is generated by some Lisp code. Unless the string is @emph{known} to never include any @samp{%} characters, pass @code{"%s"}, described below, as the first argument, and the string as the second, like this:
fr_fr: Puisque @code{format} interprète les caractères @samp{%} comme des spécifications de format, vous ne devez @emph{jamais} passer une chaîne arbitraire comme premier argument. Cela est particulièrement vrai lorsque la chaîne est générée par du code Lisp. Si la chaîne n'est pas @emph{connue} pour ne jamais inclure aucun caractère @samp{%}, passez @code{"%s"}, décrit ci-dessous, comme premier argument, et la chaîne comme deuxième, comme ceci :

source: Since it is impossible to change the length of an existing string, it is an error if @var{obj} doesn't fit within @var{string}'s actual length, or if any new character requires a different number of bytes from the character currently present at that point in @var{string}.
fr_fr: Puisqu'il est impossible de changer la longueur d'unechaîne existante, on a une erreur s'il se trouve que @var{obj} ne rentre pas dans la longueur de @var{string}, ou si un nouveau caractère nécessite un nombre d'octets différent de celui du caractère actuellement présent à cet indice dans @var{string}.

source: Since strings are arrays, and therefore sequences as well, you can operate on them with the general array and sequence functions. (@xref{Sequences Arrays Vectors}.) For example, you can access or change individual characters in a string using the functions @code{aref} and @code{aset} (@pxref{Array Functions}).
fr_fr: Puisque les chaînes de caractères sont des tableaux, et par conséquent des suites aussi, vous pouvez les traiter avec les fonctions générales des tableaux et des suites. (Voir la section @xref{Sequences, Arrays, and Vectors}.) Par exemple, on peut accéder aux caractères individuels d'une chaîne, ou les modifier, à l’aide des fonctions @code{aref} et @code{aset} (voir la section @xref{Functions that Operate on Arrays}).

source: Since the arithmetic functions do not check whether integers go outside their range, when you add 1 to 268,435,455, the value is the negative integer @minus{}268,435,456:
fr_fr: Puisque les fonctions arithmétiques ne vérifient pas si les nombres entiers ne sont pas à l'extérieur de leur champ, quand vous additionnez 1 à 268 435 455, la valeur est le nombre entier négatif @minus{}268 435 456:

source: Some Terms
fr_fr: Quelques termes

source: Some examples describe modifications to the contents of a buffer, by showing the ``before'' and ``after'' versions of the text. These examples show the contents of the buffer in question between two lines of dashes containing the buffer name. In addition, @samp{@point{}} indicates the location of point. (The symbol for point, of course, is not part of the text in the buffer; it indicates the place @emph{between} two characters where point is currently located.)
fr_fr: Quelques exemples décrivent des modifications du contenu d'un tampon, en montrant « l'avant » et « l'après » des versions du texte. Ces exemples montrent le contenu du tampon en question entre deux lignes de tirets contenant le nom du tampon. En outre, le @samp{@point{}} indique l'endroit du point. (Le symbole pour le point, naturellement, n'est pas une partie du texte dans le tampon ; il indique l'endroit @emph{entre} deux caractères où le point est actuellement localisé.)

source: Some examples signal errors. This normally displays an error message in the echo area. We show the error message on a line starting with @samp{@error{}}. Note that @samp{@error{}} itself does not appear in the echo area.
fr_fr: Quelques exemples de signal d'erreurs. Ceci montre normalement un message d'erreur dans le secteur d'écho. Nous montrons le message d'erreur sur une ligne commençant par @samp{@error{}}. Noter que @samp{@error{}} lui-même n'apparaît pas dans le secteur d'écho.
